app/controllers/api/v1/comments_controller.rb

	def create
	  post = @current_user.role == 'admin' || 'user' ? Post.find_by(id: params[:post_id]) : @current_user.posts.find_by(id: params[:post_id])
      comment = post.comments.new(comment_params)
      comment.user_id = @current_user.id
      if comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` IS NULL LIMIT 1
INSERT INTO `comments` (`desc`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('giving comment', 2, 1, '2016-05-18 06:44:04', '2016-05-18 06:44:04')

	def update
      comment = @post.comments.find_by(id: params[:id])
      if comment && comment.update_attributes(comment_params)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2 AND `comments`.`id` = 5 LIMIT 1
UPDATE `comments` SET `desc` = 'updating description', `updated_at` = '2016-05-18 06:51:49' WHERE `comments`.`id` = 5

	def destroy
		comment =  @post.comments.find_by(id: params[:id])
		if comment
		   comment.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2 AND `comments`.`id` = 5 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 5

	def find_post
		@post = @current_user.role == "admin" ? Post.find_by(id: params[:post_id]) : @current_user.posts.find_by(id: params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 2 LIMIT 1