app/controllers/api/v1/posts_controller.rb

	def create
		post = @current_user.posts.create(post_params)
---
INSERT INTO `posts` (`description`, `user_id`, `created_at`, `updated_at`) VALUES ('testing data', 1, '2016-05-18 03:44:19', '2016-05-18 03:44:19')

	def update
		post = @current_user.role == "admin" ? Post.find_by(id: params[:id]) : @current_user.posts.find_by(id: params[:id])
		if post && post.update_attributes(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `description` = 'again testing for update', `updated_at` = '2016-05-18 04:46:37' WHERE `posts`.`id` = 3

	def show
		post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1

	def destroy
		post = @current_user.role == "admin" ? Post.find_by(id: params[:id]) : @current_user.posts.find_by(id: params[:id])
		if post
		 post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 3 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 3