app/controllers/api/v1/registrations_controller.rb

  def create
  	user = User.new(user_params)
    if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `role`, `authentication_token`, `created_at`, `updated_at`) VALUES ('gourab1.techno@gmail.com', '$2a$11$RTFdcRjiaKSOoOjWRJ/OiuYXtCJNd7BKbby6xtV5m4Y4zg3r7tco6', 'admin', 'qinZ2nR_hAXs4A4JsHVq', '2016-05-17 06:30:33', '2016-05-17 06:30:33')