app/controllers/api/v1/sessions_controller.rb

  def create
    resource = User.find_by(:email=>params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = '\"gourab.techno@gmail.com\"' LIMIT 1